# 3. Сокращения. Запросите у пользователя слово и напечатайте сокращение для этого слова, состоящее из двух первых букв, тире и двух последних букв. Например, для слова "обсерватория" должно получиться "об-ия"

word = input("Введите слово: ")
if len(word) == 0:
    print("Вы не ввели ни одной буквы! Попробуйте снова")
elif len(word) < 2:
    print("Слово не может состоять из одной буквы! Попробуйте снова")  
elif len(word) == 2:
    print("Слово из 2 букв не может быть сокращено")  
elif word.isalpha():
    print("Ваше слово в сокращенном виде:", word[0:2] + '-' + word[-2:])
else:
    print("Вы ввели неверные данные! Попробуйте снова")
